>>>> # Upflairs

In [1]:
import pandas as pd
# importing pandas dataframe

In [ ]:
pd.set_option('display.max_rows', 10)
pd.set_option('display.max_columns', 5)

## Creating Series

In [4]:
# pandas series
ser = pd.Series([2,4,5,8,7,9,6,3,2,5,4,7,8])
ser

0     2
1     4
2     5
3     8
4     7
5     9
6     6
7     3
8     2
9     5
10    4
11    7
12    8
dtype: int64

In [5]:
type(ser)

pandas.core.series.Series

In [7]:
ser[ser>2]

1     4
2     5
3     8
4     7
5     9
6     6
7     3
9     5
10    4
11    7
12    8
dtype: int64

In [9]:
ser.dtypes

dtype('int64')

In [10]:
ser.shape
## number of row

(13,)

## creating pandas dataframe

In [14]:


student_record = {'studen_name':['mohan','syam','rocky','anjali'],
 'student_branch':['cse','ai','cse','it'],
 'student_class':[1,2,3,4],
 'student_age':[21,23,24,26],
 'student_per':[76,78,71,75]}

student_record

{'studen_name': ['mohan', 'syam', 'rocky', 'anjali'],
 'student_branch': ['cse', 'ai', 'cse', 'it'],
 'student_class': [1, 2, 3, 4],
 'student_age': [21, 23, 24, 26],
 'student_per': [76, 78, 71, 75]}

In [16]:
df = pd.DataFrame(student_record)
df
#dataframe created

  studen_name student_branch  student_class  student_age  student_per
0       mohan            cse              1           21           76
1        syam             ai              2           23           78
2       rocky            cse              3           24           71
3      anjali             it              4           26           75

In [17]:
# introducing dataframe element
df.columns

Index(['studen_name', 'student_branch', 'student_class', 'student_age',
       'student_per'],
      dtype='object')

In [18]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
df.shape

# 4 -- >  rows
# 5 -- >  columns

(4, 5)

In [21]:
df.dtypes
## columns types

studen_name       object
student_branch    object
student_class      int64
student_age        int64
student_per        int64
dtype: object

##  extracting columns from dataframe

In [25]:


df['studen_name']
# 'fetched student name but as series'

0     mohan
1      syam
2     rocky
3    anjali
Name: studen_name, dtype: object

In [26]:
df[['studen_name']]
# fetched as dataframe

  studen_name
0       mohan
1        syam
2       rocky
3      anjali

In [28]:
df[['studen_name','student_branch']]

  studen_name student_branch
0       mohan            cse
1        syam             ai
2       rocky            cse
3      anjali             it

## slicing

In [29]:
df[0:2]

# 0   to   2   row fetched

  studen_name student_branch  student_class  student_age  student_per
0       mohan            cse              1           21           76
1        syam             ai              2           23           78

In [32]:
df[['studen_name','student_branch']][0:2]
# row extracted with specific columns

  studen_name student_branch
0       mohan            cse
1        syam             ai

In [73]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is 9C35-B5F9

 Directory of C:\Users\Ranjit\Desktop\uplairs\upflair_prectise

28-09-2023  11:37    <DIR>          .
28-09-2023  11:37    <DIR>          ..
28-09-2023  09:51    <DIR>          .ipynb_checkpoints
28-09-2023  11:37            74,359 pandas material.ipynb
27-09-2023  00:17               909 pythn.py
               2 File(s)         75,268 bytes
               3 Dir(s)  219,985,088,512 bytes free

## Slicing with LOC and ILOC

LOC end index inclusive <br>
ILOC end exclusive, <br>
[starting point , ending point , step point]

In [36]:
df[0:2]['student_class']

0    1
1    2
Name: student_class, dtype: int64

In [38]:
df.loc[0:2,'student_class']

0    1
1    2
2    3
Name: student_class, dtype: int64

In [40]:
df.loc[0:2,['studen_name','student_age']]

  studen_name  student_age
0       mohan           21
1        syam           23
2       rocky           24

In [44]:
df.iloc[0:2,0:2]

  studen_name student_branch
0       mohan            cse
1        syam             ai

In [45]:
df.iloc[0:2:2,0:2]

  studen_name student_branch
0       mohan            cse

## Reading CSV files

In [50]:
df = pd.read_csv('Used_Bikes.csv')
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

## pandas functions

In [51]:
df.head()
# return first 5 row

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [52]:
df.tail()
# return last 5 row

,bike_name,price,city,kms_driven,owner,age,power,brand
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [53]:
df.info()
# profile of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32648 entries, 0 to 32647
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   32648 non-null  object
 1   price       32648 non-null  float64
 2   city        32648 non-null  object
 3   kms_driven  32648 non-null  float64
 4   owner       32648 non-null  object
 5   age         32648 non-null  float64
 6   power       32648 non-null  float64
 7   brand       32648 non-null  object
dtypes: float64(4), object(4)
memory usage: 2.0+ MB

In [56]:
df.dtypes
# columns data types

bike_name      object
price         float64
city           object
kms_driven    float64
owner          object
age           float64
power         float64
brand          object
dtype: object

In [57]:
df.shape

(32648, 8)

In [62]:
df[df['price'] <=20000]

,bike_name,price,city,kms_driven,owner,age,power,brand
26,Hero Super Splendor 125cc,20000.0,Ahmedabad,29305.0,First Owner,16.0,125.0,Hero
66,Hero CD Deluxe 100cc,12200.0,Agra,46643.0,First Owner,14.0,100.0,Hero
85,Bajaj Pulsar 135LS,14700.0,Delhi,10000.0,First Owner,11.0,135.0,Bajaj
103,Bajaj Pulsar 150cc,11100.0,Pune,12000.0,Third Owner,12.0,150.0,Bajaj
120,Hero Splendor Plus 100cc,19695.0,Ernakulam,51576.0,First Owner,6.0,100.0,Hero
...,...,...,...,...,...,...,...,...
32623,Hero CD Deluxe 100cc,18000.0,Chennai,22824.0,First Owner,8.0,100.0,Hero
32624,Bajaj Pulsar 150cc,14227.0,Bhopal,36000.0,First Owner,15.0,150.0,Bajaj
32631,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
32642,Hero Passion 100cc,15000.0,Perumbavoor,35000.0,Second Owner,19.0,100.0,Hero
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero

In [64]:
# extract specific columns from dataframe after filtering data

df[df['price'] <=20000][['bike_name','power']]

                       bike_name  power
26     Hero Super Splendor 125cc  125.0
66          Hero CD Deluxe 100cc  100.0
85            Bajaj Pulsar 135LS  135.0
103           Bajaj Pulsar 150cc  150.0
120     Hero Splendor Plus 100cc  100.0
...                          ...    ...
32623       Hero CD Deluxe 100cc  100.0
32624         Bajaj Pulsar 150cc  150.0
32631         Yamaha SZ-RR 150cc  150.0
32642         Hero Passion 100cc  100.0
32646  Hero Super Splendor 125cc  125.0

[5833 rows x 2 columns]

In [65]:
# multiple filter defining
df[(df['price'] <=20000) & (df['power']<=150)]

,bike_name,price,city,kms_driven,owner,age,power,brand
26,Hero Super Splendor 125cc,20000.0,Ahmedabad,29305.0,First Owner,16.0,125.0,Hero
66,Hero CD Deluxe 100cc,12200.0,Agra,46643.0,First Owner,14.0,100.0,Hero
85,Bajaj Pulsar 135LS,14700.0,Delhi,10000.0,First Owner,11.0,135.0,Bajaj
103,Bajaj Pulsar 150cc,11100.0,Pune,12000.0,Third Owner,12.0,150.0,Bajaj
120,Hero Splendor Plus 100cc,19695.0,Ernakulam,51576.0,First Owner,6.0,100.0,Hero
...,...,...,...,...,...,...,...,...
32623,Hero CD Deluxe 100cc,18000.0,Chennai,22824.0,First Owner,8.0,100.0,Hero
32624,Bajaj Pulsar 150cc,14227.0,Bhopal,36000.0,First Owner,15.0,150.0,Bajaj
32631,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
32642,Hero Passion 100cc,15000.0,Perumbavoor,35000.0,Second Owner,19.0,100.0,Hero
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero

## sorting

In [67]:
df2 = df[(df['price'] <=20000) & (df['power']<=150)]
df2.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
26,Hero Super Splendor 125cc,20000.0,Ahmedabad,29305.0,First Owner,16.0,125.0,Hero
66,Hero CD Deluxe 100cc,12200.0,Agra,46643.0,First Owner,14.0,100.0,Hero
85,Bajaj Pulsar 135LS,14700.0,Delhi,10000.0,First Owner,11.0,135.0,Bajaj
103,Bajaj Pulsar 150cc,11100.0,Pune,12000.0,Third Owner,12.0,150.0,Bajaj
120,Hero Splendor Plus 100cc,19695.0,Ernakulam,51576.0,First Owner,6.0,100.0,Hero

In [70]:
df2.sort_values('price',ascending=False).head(20)

,bike_name,price,city,kms_driven,owner,age,power,brand
26,Hero Super Splendor 125cc,20000.0,Ahmedabad,29305.0,First Owner,16.0,125.0,Hero
24157,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
23986,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
24005,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
10021,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
24062,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
24081,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
9983,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
9964,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
24309,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
9945,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
24195,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
9926,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
9907,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
24252,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
24271,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
10059,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
10078,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
23929,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha
23910,Yamaha SZ-RR 150cc,20000.0,Kanchipuram,52000.0,First Owner,10.0,150.0,Yamaha